app/controllers/todolists_controller.rb

 def create
 	#ストロングパラメーターを使用
 	list = List.new(list_params)
 	#DBへ保存する
 	list.save
---
INSERT INTO "lists" ("created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?)  [["created_at", "2019-11-07 08:25:22.621456"], ["updated_at", "2019-11-07 08:25:22.621456"], ["title", ""], ["body", ""]]

 def update
 	list = List.find(params[:id])
 	list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "投稿すると"], ["body", "編集しました"], ["updated_at", "2019-11-07 11:57:17.523783"], ["id", 1]]

 def destroy
 	list = List.find(params[:id])#データ(レコード)を１件取得
 	list.destroy #データ（レコード）を削除
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 7]]